

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	Если ЗначениеЗаполнено(Данные.Ссылка.ДействуетНаОсновании)   Тогда
		Представление = НСтр(СтрШаблон("ru = '%1 (на осн. %2)'", Данные.Наименование, Данные.Ссылка.ДействуетНаОсновании));
	Иначе
		Представление = НСтр(СтрШаблон("ru = '%1'", Данные.Наименование));
	КонецЕсли;
	
	//ОбщегоНазначения.ФамилияИнициалыФизЛица(); 
	//Этого нету в конфигурации. Мне было лень расписывать код для сокращения ФИО. 
	//На работе я стараюсь пользоваться общими модулями по максимуму.	
КонецПроцедуры

